# Comparison of Average Global Temperature

data sources, comparison, conclusions

In [1]:
# Set paths
import sys, os
sys.path.append(os.path.abspath(os.path.join('..', 'DegreesOfClimateChange')))

In [20]:
# Imports
from grab_berkeley import grab_berkeley
from grab_noaa import grab_noaa
from grab_worldbank import grab_worldbank
import matplotlib
import pandas as pd

## Data sources
Blah blah blah

### NOAA

In [3]:
df_noaa = grab_noaa()

In [5]:
df_noaa[0:6]

        Date  Tanomaly_C
0  1880-1-01       -0.00
1  1880-2-01       -0.12
2  1880-3-01       -0.13
3  1880-4-01       -0.05
4  1880-5-01       -0.07
5  1880-6-01       -0.17

### World Bank

In [16]:
df_wb = grab_worldbank()

.......computing worldwide averages across all years...hang on!!!

In [17]:
df_wb[0:6]

   Date  Tabsolute_C
0  1901    19.002034
1  1902    18.882094
2  1903    18.925365
3  1904    18.835930
4  1905    18.877793
5  1906    18.951634

### Berkeley Earth

In [21]:
df_berkeley = grab_berkeley()

In [22]:
df_berkeley[0:6]

        Date  Tanomaly_C
0  1750-1-01       0.382
1  1750-2-01       0.539
2  1750-3-01       0.574
3  1750-4-01       0.382
4  1750-5-01         NaN
5  1750-6-01         NaN

## Comparison

## Conclusions

## References

Zhang, H.-M., B. Huang, J. Lawrimore, M. Menne, Thomas M. Smith, NOAA Global Surface Temperature Dataset (NOAAGlobalTemp), Version 4.0 NOAA Global Surface Temperature Data. NOAA National Centers for Environmental Information. doi:10.7289/V5FN144H [access date].